import {MigrationInterface, QueryRunner} from "typeorm";

export class SeedCropData1765387603746 implements MigrationInterface {

    public async up(queryRunner: QueryRunner): Promise<void> {
        await queryRunner.query(`
            INSERT INTO crop (
                field_name,
                cultivated_plant_name,
                crop_start_date,
                crop_harvest_date,
                actual_harvest_tons,
                crop_status
            ) VALUES
            ('Поле 1', 'пшениця', '2023-09-20', '2024-06-20', 45, 'завершений'),
            ('Поле 1', 'соняшник', '2024-04-15', '2024-09-15', 12, 'активний'),
            ('Поле 10', 'ячмінь', '2024-03-10', '2024-07-10', 38, 'активний'),
            ('Поле 19', 'горох', '2024-03-25', '2024-07-25', 28, 'активний'),
            ('Поле 2', 'картопля', '2024-04-05', '2024-08-05', 120, 'активний'),
            ('Поле 11', 'кукурудза', '2024-04-20', '2024-09-20', 85, 'готується до посіву'),
            ('Поле 20', 'овес', '2023-03-28', '2023-07-28', 32, 'завершений'),
            ('Поле 3', 'соя', '2024-05-01', '2024-09-01', 42, 'готується до посіву'),
            ('Поле 12', 'рапс', '2023-08-25', '2024-05-25', 18, 'готується до збору'),
            ('Поле 21', 'пшениця', '2023-09-15', '2024-06-15', 40, 'завершений'),
            ('Поле 4', 'гречка', '2024-05-05', '2024-08-05', 22, 'готується до посіву'),
            ('Поле 13', 'просо', '2023-05-15', '2023-08-15', 15, 'завершений'),
            ('Поле 22', 'льон', '2024-04-10', '2024-08-10', 10, 'активний'),
            ('Поле 5', 'капуста', '2024-04-15', '2024-08-15', 35, 'активний'),
            ('Поле 14', 'морква', '2024-03-20', '2024-07-20', 28, 'активний'),
            ('Поле 23', 'овес', '2024-03-30', '2024-07-30', 30, 'активний'),
            ('Поле 6', 'жито', '2023-10-05', '2024-07-05', 36, 'готується до збору'),
            ('Поле 15', 'нут', '2024-04-15', '2024-08-15', 20, 'готується до посіву'),
            ('Поле 24', 'чечевиця', '2023-04-10', '2023-08-10', 18, 'завершений'),
            ('Поле 7', 'льон-довгунець', '2024-04-18', '2024-08-18', 12, 'готується до посіву'),
            ('Поле 16', 'конопля', '2024-04-25', '2024-08-25', 8, 'готується до посіву'),
            ('Поле 8', 'ячмінь', '2024-03-15', '2024-07-15', 25, 'активний'),
            ('Поле 17', 'жито', '2023-10-10', '2024-07-10', 22, 'готується до збору'),
            ('Поле 9', 'рис', '2024-05-10', '2024-10-10', 30, 'готується до посіву'),
            ('Поле 18', 'картопля', '2024-04-10', '2024-08-10', 90, 'активний'),
            ('Поле 1', 'соя', '2023-05-01', '2023-09-01', 40, 'завершений'),
            ('Поле 10', 'пшениця', '2023-09-18', '2024-06-18', 48, 'завершений'),
            ('Поле 19', 'соняшник', '2023-04-20', '2023-09-20', 14, 'завершений'),
            ('Поле 2', 'овес', '2023-03-25', '2023-07-25', 30, 'завершений'),
            ('Поле 11', 'горох', '2023-03-30', '2023-07-30', 25, 'завершений'),
            ('Поле 20', 'кукурудза', '2023-04-25', '2023-09-25', 80, 'завершений'),
            ('Поле 3', 'рапс', '2022-08-20', '2023-05-20', 16, 'завершений'),
            ('Поле 12', 'пшениця', '2022-09-15', '2023-06-15', 42, 'завершений'),
            ('Поле 21', 'соя', '2023-05-05', '2023-09-05', 38, 'завершений'),
            ('Поле 4', 'льон', '2023-04-12', '2023-08-12', 9, 'завершений'),
            ('Поле 13', 'гречка', '2023-05-10', '2023-08-10', 20, 'завершений'),
            ('Поле 22', 'просо', '2023-05-20', '2023-08-20', 14, 'завершений'),
            ('Поле 5', 'морква', '2023-03-15', '2023-07-15', 25, 'завершений'),
            ('Поле 14', 'капуста', '2023-04-10', '2023-08-10', 32, 'завершений'),
            ('Поле 23', 'овес', '2023-03-25', '2023-07-25', 28, 'завершений'),
            ('Поле 1', 'пшениця', '2025-03-20', '2025-08-10', 42, 'завершений'),
            ('Поле 2', 'ячмінь', '2025-03-15', '2025-07-30', 33, 'завершений'),
            ('Поле 3', 'кукурудза', '2025-04-10', '2025-09-25', 51, 'завершений'),
            ('Поле 4', 'жито', '2025-09-01', '2026-06-01', 24, 'активний'),
            ('Поле 6', 'кукурудза', '2025-05-01', '2025-10-01', 18, 'активний'),
            ('Поле 7', 'картопля', '2025-03-10', '2025-08-05', 29, 'завершений'),
            ('Поле 8', 'морква', '2025-04-01', '2025-09-01', 17, 'завершений'),
            ('Поле 9', 'пшениця', '2024-03-15', '2024-08-05', 40, 'завершений'),
            ('Поле 10', 'соняшник', '2024-04-10', '2024-09-20', 22, 'завершений');
        `);
    }

    public async down(queryRunner: QueryRunner): Promise<void> {
        await queryRunner.query(`DELETE FROM crop;`);
    }
}